madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	/* Affiche tout caractère ASCII 32..127 (inclus). */
	if (c < 32 || c > 127) {
		return;
	}

	const uint8_t *bitmap = font_5x7[c - 32];
	for (uint8_t col = 0; col < 5; col++) {
		uint8_t bits = bitmap[col];
		for (uint8_t row = 0; row < 7; row++) {
			if (bits & (1 << row)) {
				allumer_pixel(i2c_dev, x + col, y + row);
			} else {
				eteindre_pixel(i2c_dev, x + col, y + row);
			}
		}
	}

	/* Nettoie la colonne d'espacement pour eviter les residus entre caracteres. */
	for (uint8_t row = 0; row < 7; row++) {
		eteindre_pixel(i2c_dev, x + 5, y + row);
	}
}


// Rayon moyen de la Terre en mètres
#define EARTH_RADIUS 6371000.0

#define PI 3.14159265358979323846


void calcul_cap_distance_int(double lat1, double lon1, double lat2, double lon2, int *cap_deg, int *distance_m) {
    // Conversion degrés -> radians
    double lat1_rad = lat1 * PI / 180.0;
    double lon1_rad = lon1 * PI / 180.0;
    double lat2_rad = lat2 * PI / 180.0;
    double lon2_rad = lon2 * PI / 180.0;

    // Formule de Haversine pour la distance
    double dlat = lat2_rad - lat1_rad;
    double dlon = lon2_rad - lon1_rad;
    double a = sin(dlat/2) * sin(dlat/2) +
               cos(lat1_rad) * cos(lat2_rad) *
               sin(dlon/2) * sin(dlon/2);
    double c = 2 * atan2(sqrt(a), sqrt(1-a));
    *distance_m = (int)round(EARTH_RADIUS * c);

    // Calcul du cap (azimut initial)
    double y = sin(dlon) * cos(lat2_rad);
    double x = cos(lat1_rad)*sin(lat2_rad) -
               sin(lat1_rad)*cos(lat2_rad)*cos(dlon);
    double cap_rad = atan2(y, x);
    *cap_deg = (int)round(fmod((cap_rad * 180.0 / PI) + 360.0, 360.0));
}


#define EARTH_RADIUS_METERS (6371.0 * 1000.0)

struct shared_state {
	struct k_mutex mutex;
	struct k_condvar cond;
	bool ready;
};

static struct shared_state state;
K_SEM_DEFINE(time_sem, 0, 1);
static struct k_work agps_data_get_work;
static volatile bool requesting_assistance;
static struct nrf_modem_gnss_pvt_data_frame last_pvt;
static volatile bool gnss_has_fix;
static bool ref_used;
static double ref_latitude;
static double ref_longitude;
static int64_t fix_timestamp;
static struct k_mutex lte_mutex;

static const char *gnss_antenna_mode(void)
{
#if defined(CONFIG_MODEM_ANTENNA_GNSS_EXTERNAL)
	return "external";
#else
	return "internal";
#endif
}

#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) || defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
static struct k_work_q gnss_work_q;

#define GNSS_WORKQ_THREAD_STACK_SIZE 2304
#define GNSS_WORKQ_THREAD_PRIORITY   5

K_THREAD_STACK_DEFINE(gnss_workq_stack_area, GNSS_WORKQ_THREAD_STACK_SIZE);
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE || CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */

#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)
#include "assistance.h"

static struct nrf_modem_gnss_agps_data_frame last_agps;

static void gnss_event_handler(int event)
{
	switch (event) {
	case NRF_MODEM_GNSS_EVT_PVT:
		if (nrf_modem_gnss_read(&last_pvt, sizeof(last_pvt), NRF_MODEM_GNSS_DATA_PVT) == 0) {
			k_mutex_lock(&state.mutex, K_FOREVER);
			state.ready = true;
			k_condvar_broadcast(&state.cond);
			k_mutex_unlock(&state.mutex);
		}
		break;

	case NRF_MODEM_GNSS_EVT_AGPS_REQ:
		if (nrf_modem_gnss_read(&last_agps, sizeof(last_agps), NRF_MODEM_GNSS_DATA_AGPS_REQ) == 0) {
			k_work_submit_to_queue(&gnss_work_q, &agps_data_get_work);
		}
		break;

	default:
		break;
	}
}

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
K_SEM_DEFINE(lte_ready, 0, 1);

static void lte_lc_event_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type) {
	case LTE_LC_EVT_NW_REG_STATUS:
		if ((evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME) ||
		    (evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING)) {
			LOG_INF("Connected to LTE network");
			k_sem_give(&lte_ready);
		}
		break;

	default:
		break;
	}
}
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
void lte_connect(void)
{
	int err;

	LOG_INF("Connecting to LTE network...");

	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_LTE);
	if (err) {
		LOG_ERR("Failed to activate LTE, error: %d", err);
		return;
	}

	k_sem_take(&lte_ready, K_FOREVER);

	/* Wait for a while, because with IPv4v6 PDN the IPv6 activation takes a bit more time. */
	k_sleep(K_SECONDS(1));
}

void lte_disconnect(void)
{
	int err;

	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);
	if (err) {
		LOG_ERR("Failed to deactivate LTE, error: %d", err);
		return;
	}

	LOG_INF("LTE disconnected");
}
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

static void agps_data_get_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	int err;

#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_SUPL)
	/* SUPL doesn't usually provide NeQuick ionospheric corrections and satellite real time
	 * integrity information. If GNSS asks only for those, the request should be ignored.
	 */
	if (last_agps.sv_mask_ephe == 0 &&
	    last_agps.sv_mask_alm == 0 &&
	    (last_agps.data_flags & ~(NRF_MODEM_GNSS_AGPS_NEQUICK_REQUEST |
				      NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST)) == 0) {
		LOG_INF("Ignoring assistance request for only NeQuick and/or integrity");
		return;
	}
#endif /* CONFIG_GNSS_SAMPLE_ASSISTANCE_SUPL */

#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_MINIMAL)
	/* With minimal assistance, the request should be ignored if no GPS time or position
	 * is requested.
	 */
	if (!(last_agps.data_flags & NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST) &&
	    !(last_agps.data_flags & NRF_MODEM_GNSS_AGPS_POSITION_REQUEST)) {
		LOG_INF("Ignoring assistance request because no GPS time or position is requested");
		return;
	}
#endif /* CONFIG_GNSS_SAMPLE_ASSISTANCE_MINIMAL */

	requesting_assistance = true;

	LOG_INF("Assistance data needed, ephe 0x%08x, alm 0x%08x, flags 0x%02x",
		last_agps.sv_mask_ephe,
		last_agps.sv_mask_alm,
		last_agps.data_flags);

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	k_mutex_lock(&lte_mutex, K_FOREVER);
	lte_connect();
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	err = assistance_request(&last_agps);
	if (err) {
		LOG_ERR("Failed to request assistance data");
	}

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	lte_disconnect();
	k_mutex_unlock(&lte_mutex);
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	requesting_assistance = false;
}
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE */

	#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) && !defined(CONFIG_GNSS_SAMPLE_STRICT_GNSS_ONLY)
	static int startup_assistance_preload(void)
	{
		LOG_INF("A-GPS startup preload skipped");
		return 0;
	}
	#endif




static void date_time_evt_handler(const struct date_time_evt *evt)
{
	k_sem_give(&time_sem);
}

static int modem_init(void)
{
	if (IS_ENABLED(CONFIG_DATE_TIME)) {
		date_time_register_handler(date_time_evt_handler);
	}

	if (lte_lc_init() != 0) {
		LOG_ERR("Failed to initialize LTE link controller");
		return -1;
	}

#if defined(CONFIG_GNSS_SAMPLE_STRICT_GNSS_ONLY)
	LOG_INF("Strict GNSS-only test mode: leaving LTE deactivated");
	return 0;
#endif

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	lte_lc_register_handler(lte_lc_event_handler);
	lte_lc_psm_req(true);

