madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	if (lte_lc_system_mode_set(LTE_LC_SYSTEM_MODE_LTEM_GPS,
				   LTE_LC_SYSTEM_MODE_PREFER_LTEM) != 0) {
		LOG_ERR("Failed to set LTE/GPS system mode");
		return -1;
	}
#elif !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)
	lte_lc_psm_req(true);

	LOG_INF("Connecting to LTE network");

	if (lte_lc_connect() != 0) {
		LOG_ERR("Failed to connect to LTE network");
		return -1;
	}

	LOG_INF("Connected to LTE network");

	if (IS_ENABLED(CONFIG_DATE_TIME)) {
		LOG_INF("Waiting for current time");

		/* Wait for an event from the Date Time library. */
		k_sem_take(&time_sem, K_MINUTES(10));

		if (!date_time_is_valid()) {
			LOG_WRN("Failed to get current time, continuing anyway");
		}
	}
#endif

	return 0;
}

static int sample_init(void)
{
	int err = 0;

#if (!defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) && !defined(CONFIG_GNSS_SAMPLE_STRICT_GNSS_ONLY)) || \
	defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	struct k_work_queue_config cfg = {
		.name = "gnss_work_q",
		.no_yield = false
	};

	k_work_queue_start(
		&gnss_work_q,
		gnss_workq_stack_area,
		K_THREAD_STACK_SIZEOF(gnss_workq_stack_area),
		GNSS_WORKQ_THREAD_PRIORITY,
		&cfg);
	#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE || CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */

#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) && !defined(CONFIG_GNSS_SAMPLE_STRICT_GNSS_ONLY)
	k_work_init(&agps_data_get_work, agps_data_get_work_fn);

	err = assistance_init(&gnss_work_q);
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE */

	return err;
}

static int gnss_init_and_start(void)
{


#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) || defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	/* Enable GNSS. */
	if (lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_GNSS) != 0) {
		LOG_ERR("Failed to activate GNSS functional mode");
		return -1;
	}
#endif /* CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE || CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	/* Configure GNSS. */
	if (nrf_modem_gnss_event_handler_set(gnss_event_handler) != 0) {
		LOG_ERR("Failed to set GNSS event handler");
		return -1;
	}

	/* NMEA output is disabled because this application does not consume it. */
	uint16_t nmea_mask = 0;

	if (nrf_modem_gnss_nmea_mask_set(nmea_mask) != 0) {
		LOG_ERR("Failed to set GNSS NMEA mask");
		return -1;
	}

	/* This use case flag should always be set. */
	uint8_t use_case = NRF_MODEM_GNSS_USE_CASE_MULTIPLE_HOT_START;

	if (IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_PERIODIC) &&
	    !IS_ENABLED(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)) {
		/* Disable GNSS scheduled downloads when assistance is used. */
		use_case |= NRF_MODEM_GNSS_USE_CASE_SCHED_DOWNLOAD_DISABLE;
	}

	if (IS_ENABLED(CONFIG_GNSS_SAMPLE_LOW_ACCURACY)) {
		use_case |= NRF_MODEM_GNSS_USE_CASE_LOW_ACCURACY;
	}

	if (nrf_modem_gnss_use_case_set(use_case) != 0) {
		LOG_WRN("Failed to set GNSS use case");
	}

#if defined(CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK)
	if (nrf_modem_gnss_elevation_threshold_set(CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK) != 0) {
		LOG_ERR("Failed to set elevation threshold");
		return -1;
	}
	LOG_DBG("Set elevation threshold to %u", CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK);
#endif

#if defined(CONFIG_GNSS_SAMPLE_MODE_CONTINUOUS)
	/* Default to no power saving. */
	uint8_t power_mode = NRF_MODEM_GNSS_PSM_DISABLED;

#if defined(GNSS_SAMPLE_POWER_SAVING_MODERATE)
	power_mode = NRF_MODEM_GNSS_PSM_DUTY_CYCLING_PERFORMANCE;
#elif defined(GNSS_SAMPLE_POWER_SAVING_HIGH)
	power_mode = NRF_MODEM_GNSS_PSM_DUTY_CYCLING_POWER;
#endif

	if (nrf_modem_gnss_power_mode_set(power_mode) != 0) {
		LOG_ERR("Failed to set GNSS power saving mode");
		return -1;
	}
#endif /* CONFIG_GNSS_SAMPLE_MODE_CONTINUOUS */

	/* Default to continuous tracking. */
	uint16_t fix_retry = 0;
	uint16_t fix_interval = 1;

#if defined(CONFIG_GNSS_SAMPLE_MODE_PERIODIC)
	fix_retry = CONFIG_GNSS_SAMPLE_PERIODIC_TIMEOUT;
	fix_interval = CONFIG_GNSS_SAMPLE_PERIODIC_INTERVAL;
#elif defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	/* Single fix for TTFF test mode. */
	fix_retry = 0;
	fix_interval = 0;
#endif

	if (nrf_modem_gnss_fix_retry_set(fix_retry) != 0) {
		LOG_ERR("Failed to set GNSS fix retry");
		return -1;
	}

	if (nrf_modem_gnss_fix_interval_set(fix_interval) != 0) {
		LOG_ERR("Failed to set GNSS fix interval");
		return -1;
	}


#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) && !defined(CONFIG_GNSS_SAMPLE_STRICT_GNSS_ONLY)
	/* Preload assistance at startup to improve cold-start TTFF. */
	int preload_err = startup_assistance_preload();
	if (preload_err) {
		LOG_WRN("A-GPS startup preload returned error: %d", preload_err);
	} else {
		LOG_INF("A-GPS startup preload completed");
	}
#endif

	log_modem_state("Before GNSS start");

	if (nrf_modem_gnss_start() != 0) {
		LOG_ERR("Failed to start GNSS");
		return -1;
	}


	return 0;
}























float targets[10];
const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
int targets_count = 0;

uint8_t last_tracked = 0;
uint8_t last_in_fix = 0;
uint8_t last_unhealthy = 0;

uint8_t gps_tracking = 0;
uint8_t gps_using = 0;
uint8_t gps_unk = 0;


double last_latitude = 0;
double last_longitude = 0;

double ref_latitude2 = 0;
double ref_longitude2 = 0;

int lte_wait = 0;
int lte_quota = 10;

volatile int position=0;
float lat[5];
float lng[5];
time_t ts[5];

#define HTTP_HOST "plongee.duckdns.org"
#define HTTP_PATH "/targets"
#define HTTP_PATH_LONG "/coords"
#define HTTP_PORT 8545
#define MAX_MTU_SIZE     2000
#define RECV_BUF_SIZE    2048
#define SEND_BUF_SIZE    MAX_MTU_SIZE
#define MAX_DISPLAY_TARGETS 4

static int displayed_targets_count = -1;
static int displayed_heading[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };
static int displayed_distance[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase);

static void reset_target_value_cache(void)
{
	for (int i = 0; i < MAX_DISPLAY_TARGETS; i++) {
		displayed_heading[i] = -1;
		displayed_distance[i] = -1;
	}
}

static void clear_target_rows(const struct device *i2c_dev)
{
	char blank_row[23];
	memset(blank_row, ' ', sizeof(blank_row) - 1);
	blank_row[sizeof(blank_row) - 1] = '\0';

	for (int row = 0; row < MAX_DISPLAY_TARGETS; row++) {
		uint8_t y = 32 + (row * 8);
		write_line(i2c_dev, blank_row, 0, y, 0);
	}
}

static void draw_target_rows_layout(const struct device *i2c_dev, int count)
{
	uint8_t y = 32;
	char message[16];

	if (count < 0) {
		count = 0;
	}
	if (count > MAX_DISPLAY_TARGETS) {
		count = MAX_DISPLAY_TARGETS;
	}

	clear_target_rows(i2c_dev);

	for (int i = 0; i < count; i++) {
		if (y > (SSD1306_HEIGHT - 8)) {
			break;
		}

		snprintf(message, sizeof(message), "%1d:", i + 1);
		write_line(i2c_dev, message, 0, y, 0);
		write_line(i2c_dev, "DEG", 7 * 6, y, 0);
		write_line(i2c_dev, "|", 12 * 6, y, 0);
		write_line(i2c_dev, "M", 20 * 6, y, 0);

		y += 8;
	}

