madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	displayed_targets_count = count;
	reset_target_value_cache();
}

#define JSON_TEMPLATE "%ld,%.9f,%.9f"
#define JSON_TEMPLATE_LONG "%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f"

char send_buf[2000];

bool gps_state = 1;
bool lte_state = 0;
time_t timestamp;
volatile float avg = 0;
float thresold = 19;
int reset_threshold = 20;

int refresh_rate = 1000;
int confirmation_rate = 20;

int menu = -1;
int tap_state = 0;
int confirmation_state = 0;

const char *menu_str[] = {
    "EXIT MENU",
	"GPS:",
    "LTE:",
	"RELOAD COORDINATES",
	"FW UPDATE",
	"OFF"
};
int nb_menu = 6;

K_THREAD_STACK_DEFINE(accelerometer_stack, 1024);
K_THREAD_STACK_DEFINE(tap_stack, 1024);
K_THREAD_STACK_DEFINE(gps_stack, 1024);
K_THREAD_STACK_DEFINE(coordinates_stack, 2048);

struct k_thread accelerometer_data;
struct k_thread tap_data;
struct k_thread gps_data;
struct k_thread coordinates_data;

int measure_rate = 10;

float valuex = 0;
float valuey = 0;
float valuez = 0;

int tap_reset_rate = 10;
int tap_threshold = 35;
int tap_kickback_waittime = 100;
int confirmation_timeout = 30;
int multitap = 0;
int bypass = 0;
uint32_t last_fix = 0;
int gps_rate = 500;
volatile int first = 0;
uint32_t ref_lastfix = 0;
uint32_t last_gnss_diag = 0;
volatile bool gnss_display_dirty = true;





void clear_display(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    // 1. Efface le framebuffer RAM
    memset(framebuffer, 0, sizeof(framebuffer));

    // 2. Pour chaque page, envoie 128 zéros d'un coup
	for (uint8_t page = 0; page < SSD1306_PAGES; page++) {
        ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
        ssd1306_write_cmd(i2c_dev, 0);    // Start column
		ssd1306_write_cmd(i2c_dev, SSD1306_WIDTH - 1);  // End column
        ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
        ssd1306_write_cmd(i2c_dev, page); // Start page
        ssd1306_write_cmd(i2c_dev, page); // End page

        // Envoie 128 octets d'un coup (plus rapide que 128 appels séparés)
        uint8_t buf[129];
        buf[0] = 0x40; // Control byte for data
		memset(&buf[1], 0, SSD1306_WIDTH);
        i2c_write(i2c_dev, buf, sizeof(buf), SSD1306_I2C_ADDR);
    }
	k_mutex_unlock(&display_mutex);
}

void print_satellite_stats(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	uint8_t tracked = 0;
	uint8_t in_fix = 0;
	uint8_t unhealthy = 0;

	for (int i = 0; i < NRF_MODEM_GNSS_MAX_SATELLITES; ++i) {
		if (pvt_data->sv[i].sv <= 0) {
			continue;
		}

		tracked++;
		if (pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX) {
			in_fix++;
		}
		if (pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY) {
			unhealthy++;
		}
	}

	gps_tracking = tracked;
	gps_using = in_fix;
	gps_unk = unhealthy;

	LOG_INF("GNSS searching: tracked=%u used=%u unhealthy=%u", tracked, in_fix, unhealthy);
}

void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	struct tm tm = { 0 };

	tm.tm_year = pvt_data->datetime.year - 1900;
	tm.tm_mon = pvt_data->datetime.month - 1;
	tm.tm_mday = pvt_data->datetime.day;
	tm.tm_hour = pvt_data->datetime.hour;
	tm.tm_min = pvt_data->datetime.minute;
	tm.tm_sec = pvt_data->datetime.seconds;
	tm.tm_isdst = 0;

	timestamp = mktime(&tm);
	last_latitude = pvt_data->latitude;
	last_longitude = pvt_data->longitude;
}

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase);

int blocking_send(int fd, uint8_t *buf, uint32_t size, uint32_t flags)
{
	int err;

	do {
		err = send(fd, buf, size, flags);
	} while (err < 0 && errno == EAGAIN);

	return err;
}

int blocking_connect(int fd, struct sockaddr *local_addr, socklen_t len)
{
	int err;

	do {
		err = connect(fd, local_addr, len);
	} while (err < 0 && errno == EAGAIN);

	return err;
}

void initial_connexion(){
	LOG_INF("initial_connexion: begin fetching targets");

	int err = 0;

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_DGRAM,
        .ai_next = NULL,
        .ai_addr = NULL,
		.ai_protocol = 0,
	};

    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d", err);
	if (err != 0) {
		return;
	}
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d", client_fd);
	if (client_fd < 0) {
		freeaddrinfo(res);
		return;
	}
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d", err);


    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d", err);


	if (err >= 0) {


	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     HTTP_PATH, HTTP_HOST);



    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	static char recv_buf[RECV_BUF_SIZE * 2];
	memset(recv_buf, 0, sizeof(recv_buf));
	int tot_num_bytes = 0;
	int recv_offset = 0;
	struct timeval recv_timeout = {
		.tv_sec = 5,
		.tv_usec = 0,
	};
	setsockopt(client_fd, SOL_SOCKET, SO_RCVTIMEO, &recv_timeout, sizeof(recv_timeout));

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf + recv_offset,
				 sizeof(recv_buf) - recv_offset - 1, 0);
		if (num_bytes > 0) {
			tot_num_bytes += num_bytes;
		}
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);
		if (num_bytes < 0) {
			if (errno == EAGAIN || errno == EWOULDBLOCK) {
				LOG_INF("recv timeout after %d bytes", tot_num_bytes);
				break;
			}
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
		if (num_bytes == 0) {
			break;
		}
		recv_offset += num_bytes;
		recv_buf[recv_offset] = '\0';
		//LOG_INF("%s\n", recv_buf);
	} while (num_bytes > 0);


    double values[10];                       // Tableau pour stocker les doubles
    size_t count = 0;
	char *body = strstr(recv_buf, "\r\n\r\n");
	if (body != NULL) {
		body += 4;
	} else {
		body = recv_buf;
	}

	LOG_INF("Targets response body starts with: %.80s", body);

	char *scan = body;
	while (*scan != '\0' && count < 10) {
		char *endptr;
		double parsed = strtod(scan, &endptr);

		if (endptr == scan) {
			scan++;
			continue;
		}

		values[count] = parsed;
		count++;
		scan = endptr;
	}

