madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	targets_count = (count / 2);
	if (targets_count > MAX_DISPLAY_TARGETS) {
		LOG_WRN("Parsed %u targets; clamping display to %u", targets_count, MAX_DISPLAY_TARGETS);
		targets_count = MAX_DISPLAY_TARGETS;
	}
	LOG_INF("Parsed %u coordinate pairs from server", targets_count);


    // Afficher les résultats
    for (size_t i = 0; i < targets_count*2; i++) {
		targets[i] = values[i];
    }

    LOG_INF("Finished. Closing socket");
    err = close(client_fd);
	    LOG_INF("initial_connexion: socket closed");
	    freeaddrinfo(res);
	    LOG_INF("initial_connexion: done");

	}
}

void flash_firmware(){

	int err = 0;

	int k = 0;
	while(lte_lc_connect()!= 0) {
		k+=1;
				LOG_INF("Waiting for LTE connection, attempt %d", k);

		if(k >= 5){
			return;
		}
	}

		LOG_INF("Connected to LTE network");

		

	struct flash_img_context fic;

	struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};



	flash_img_init_id(&fic, PM_MCUBOOT_SECONDARY_ID); // Or appropriate slot ID
	boot_erase_img_bank(PM_MCUBOOT_SECONDARY_ID);

	
    err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));

	if (err >= 0) {
	
	send_data_len = snprintf(send_buf, 2000,
                                     "GET %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n",
                                     "/firmware", HTTP_HOST);



    do {
        num_bytes = blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };
		

    } while (num_bytes < 0);

	char recv_buf[RECV_BUF_SIZE];
	int tot_num_bytes = 0;

	do {
		/* TODO: make a proper timeout *
		 * Current solution will just hang 
		 * until remote side closes connection */
		num_bytes = recv(client_fd, recv_buf, RECV_BUF_SIZE, 0);
		tot_num_bytes += num_bytes;
                LOG_INF("total number of bytes: %d\n", tot_num_bytes);
                LOG_INF("num bytes: %d\n", num_bytes);


		err = flash_img_buffered_write(&fic, recv_buf, num_bytes, false);
        if (err) {
            printk("Erreur écriture flash: %d\n", err);
            break;
        }
		
				
		if (num_bytes < 0) {
			LOG_INF("\nrecv errno: %d\n", errno);
			break;
		}
	} while (num_bytes > 0);

	}


	// Flush final pour s'assurer que tout est écrit
	err = flash_img_buffered_write(&fic, NULL, 0, true);
	if (err) {
		printk("Erreur flush final: %d\n", err);
	}

	LOG_WRN("Firmware image written; reboot disabled during diagnostics");
	return;


}

void send_to_cloud(void)
{
	LOG_INF("send_to_cloud: skipped during LTE diagnostics");
}

float sensor_value_to_float(const struct sensor_value *val)
{
    return (float)val->val1 + (val->val2 / 1000000.0f);
}
 
void accelerometer_thread(void *a, void *b, void *c) {

	const struct device *lis2dh = (const struct device *)a;

    while (1) {

		struct sensor_value accel[3];
		if (sensor_sample_fetch(lis2dh) < 0) {
			LOG_INF("Erreur lors de la récupération des données du capteur\n");
			return;
		}

		if (sensor_channel_get(lis2dh, SENSOR_CHAN_ACCEL_XYZ, accel) < 0) {
			LOG_INF("Erreur lors dze la récupération des données du capteur\n");
			return;
		}

		float ax = sensor_value_to_float(&accel[0]);
		float ay = sensor_value_to_float(&accel[1]);
		float az = sensor_value_to_float(&accel[2]);


		avg += sqrtf(ax*ax+ay*ay+az*az)-9.8;


		valuex = ax*ax;
		valuey = ay*ay;
		valuez = az*az;


		k_sleep(K_MSEC(measure_rate));

    }
}

void tap_thread(void *a, void *b, void *c) {

	int reset_state = 0;

	while(1){

		if(reset_state >= reset_threshold){

			reset_state = 0;
			avg = 0;
			tap_state = 0;
			
		}

		if(fabs(avg) > tap_threshold){
			LOG_INF("TAPPED %.2f",valuex);

			tap_state = 1;
			reset_state = reset_threshold;
			k_sleep(K_MSEC(tap_kickback_waittime));
		}

		k_sleep(K_MSEC(tap_reset_rate));
		reset_state += 1;
	}
}

void gps_thread(void *a, void *b, void *c) {

while(true){

k_mutex_lock(&state.mutex, K_FOREVER);
while(!state.ready) {
	k_condvar_wait(&state.cond, &state.mutex,K_FOREVER);
}
k_mutex_unlock(&state.mutex);


	LOG_INF("GPS");
			print_satellite_stats(&last_pvt);

			if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
							gnss_has_fix = true;
							fix_timestamp = k_uptime_get();
							print_fix_data(&last_pvt);
								last_fix = 0;
								gnss_display_dirty = true;
							//print_distance_from_reference(&last_pvt);


						} else {

							last_fix = (uint32_t)((k_uptime_get() - fix_timestamp) / 1000);
							gnss_display_dirty = true;

							if ((k_uptime_get_32() - last_gnss_diag) >= 5000U) {
								LOG_WRN("GNSS searching: tracked=%u used=%u unhealthy=%u last_fix=%us antenna=%s",
									gps_tracking,
									gps_using,
									gps_unk,
									last_fix,
									gnss_antenna_mode());
								last_gnss_diag = k_uptime_get_32();
							}

						}

	k_sleep(K_MSEC(gps_rate));

}



}

void exit_menu(const struct device *i2c_dev){

	menu = -1;
	clear_display(i2c_dev);

}

void change_gps(const struct device *i2c_dev){

uint8_t x = 5*6, y = 8;
char message[128];
if(gps_state == 0){
	gps_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							gps_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void change_lte(const struct device *i2c_dev){

