madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
uint8_t x = 5*6, y = 16;
char message[128];
if(lte_state == 0){
	lte_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							lte_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void reload_coordinates(const struct device *i2c_dev){

	if(lte_state == 0){return;}

	clear_display(i2c_dev);

	uint8_t x = 0, y = 0;
	char line[128];
	snprintf(line,sizeof(line),"INITIALIZATION...");
	write_line(i2c_dev, line, x, y, 0);


	initial_connexion();

	menu = -2;
	bypass = 1;
	multitap = 1;
	first = 0;

}


void coordinates_thread(void *a, void *b, void *c)
{
	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	k_sleep(K_SECONDS(2));

	while (1) {
		k_mutex_lock(&lte_mutex, K_FOREVER);
		lte_connect();
		LOG_INF("coordinates_thread: starting coordinates fetch");
		initial_connexion();
		lte_disconnect();
		k_mutex_unlock(&lte_mutex);

		if (targets_count > 0) {
			LOG_INF("coordinates_thread: loaded %d targets", targets_count);
			break;
		}

		LOG_WRN("coordinates_thread: no targets yet, retrying in 60s");
		k_sleep(K_SECONDS(60));
	}
}
void firmware_update(const struct device *i2c_dev){


if(lte_state == 0){return; }

	clear_display(i2c_dev);


	uint8_t x = 5*6, y = 16;
	

	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	flash_firmware();


	menu = -1;
	bypass = 1;
	multitap = 1;

}

void ssd1306_power_off(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
	k_mutex_unlock(&display_mutex);
}

void ssd1306_power_on(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
	k_mutex_unlock(&display_mutex);
}

void off(const struct device *i2c_dev){

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = false;
	k_mutex_unlock(&state.mutex);

	ssd1306_power_off(i2c_dev);

	while(tap_state == 0){


		k_sleep(K_SECONDS(5));

	}

	ssd1306_power_on(i2c_dev);

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = true;
	k_condvar_broadcast(&state.cond);
	k_mutex_unlock(&state.mutex);

}

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase) {
	if (y > (SSD1306_HEIGHT - 7)) {
		return;
	}

	int cursor = x;
	for (const char *p = line; *p; p++) {
		if (cursor > (SSD1306_WIDTH - 5)) {
			break;
		}

		dessiner_caractere(i2c_dev, *p, (uint8_t)cursor, y, erase);
		cursor += 6;
	}
}

int main(void)
{

	k_mutex_init(&display_mutex);
	k_mutex_init(&lte_mutex);
	k_mutex_init(&state.mutex);
	k_condvar_init(&state.cond);
	state.ready = true;
	uint8_t x = 0, y = 0;
	char message[128];
	int err;
	bool home_screen_cleared = false;

	//const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
	if (!device_is_ready(i2c_dev)) {
		LOG_ERR("I2C device not ready");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}
	LOG_INF("I2C device is ready");
	LOG_INF("GNSS antenna mode: %s", gnss_antenna_mode());

	clear_display(i2c_dev); // Efface l'écran avant de dessiner
    ssd1306_init(i2c_dev); // <-- Ajoute cette ligne ici


	snprintf(message, sizeof(message), "%s %s", __DATE__, __TIME__);
	write_line(i2c_dev, message, 0, 0, 1);
	k_sleep(K_SECONDS(5));

	clear_display(i2c_dev);
	snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
	write_line(i2c_dev, message, 0, 0, 0);
	snprintf(message, sizeof(message), "LAST FIX: %d", 0);
	write_line(i2c_dev, message, 0, 8, 0);
	snprintf(message, sizeof(message), "                ");
	write_line(i2c_dev, message, 0, 32, 0);
	home_screen_cleared = true;
	first = 0;

    const struct device *lis2dh = DEVICE_DT_GET_ONE(st_lis2dh);
    if (!device_is_ready(lis2dh)) {
        LOG_ERR("Erreur : LIS2DH non prêt\n");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
    }

	k_thread_create(&accelerometer_data, accelerometer_stack, 1024,accelerometer_thread, (void *)lis2dh, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&tap_data, tap_stack, 1024,tap_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&gps_data, gps_stack, 1024,gps_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);


	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	log_modem_state("After modem init");

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	LOG_INF("main: starting coordinates thread");
	k_thread_create(&coordinates_data, coordinates_stack, K_THREAD_STACK_SIZEOF(coordinates_stack),
			coordinates_thread, NULL, NULL, NULL, 7, 0, K_NO_WAIT);

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	LOG_INF("main: starting initial coordinates fetch");
	fix_timestamp = k_uptime_get();

	multitap = 0;
	int confirmation = 0;

	while(true){

	if(menu == -1){
		int visible_targets = targets_count;
		if (visible_targets > MAX_DISPLAY_TARGETS) {
			visible_targets = MAX_DISPLAY_TARGETS;
		}

		if (!home_screen_cleared) {
			clear_display(i2c_dev);
			home_screen_cleared = true;
		}

		if(first == 0){
					
			clear_display(i2c_dev);
			snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
			write_line(i2c_dev, message, 0, 0, 0);

			snprintf(message, sizeof(message), "LAST FIX: %d",0);
			write_line(i2c_dev, message, 0, 8, 0);
			draw_target_rows_layout(i2c_dev, visible_targets);


