madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
		}

		if (displayed_targets_count != visible_targets) {
			draw_target_rows_layout(i2c_dev, visible_targets);
			gnss_display_dirty = true;
		}

		if(last_fix != ref_lastfix){
			ref_lastfix = last_fix;
			y=8;
			x=10*6;

			snprintf(message, sizeof(message), "%d   ",last_fix);
			write_line(i2c_dev, message, x,y,1);

		}

		if(gps_state == 1 || first == 0){

			first = 1;
			y = 0;

			if(last_tracked != gps_tracking){


				x=3*6;

				snprintf(message, sizeof(message), "%2d", gps_tracking);
				write_line(i2c_dev, message,x,y,1);

				last_tracked = gps_tracking;

			}

			if(last_in_fix != gps_using){

				x=9*6;
				snprintf(message, sizeof(message), "%2d", gps_using);

				write_line(i2c_dev,message,x,y,1);


				last_in_fix = gps_using;
			}

			if(last_unhealthy != gps_unk){

			x=16*6;
			snprintf(message, sizeof(message), "%2d", gps_unk);

			write_line(i2c_dev,message,x,y,1);

			last_unhealthy = gps_unk;

			}

			if(lte_state == 1 && gps_using >= 4){

			if(position >= 5*20){

				position = 0;

				k_mutex_lock(&lte_mutex, K_SECONDS(60));

				send_to_cloud();

				k_mutex_unlock(&lte_mutex);

			}

			if((position+20) % 20 == 0){
				ts[position/20] = timestamp;
				lat[position/20] = last_latitude;
				lng[position/20] = last_longitude;
			}

			position++;



			}

		if(gnss_display_dirty || fabs(ref_latitude2 - last_latitude) > 0.00001 || fabs(ref_longitude2 - last_longitude) > 0.00001){

ref_latitude2 = last_latitude;
ref_longitude2 = last_longitude;
			gnss_display_dirty = false;

x = 0;
y = 32;

for(int i=0;i<visible_targets;i++){

	if (y > (SSD1306_HEIGHT - 8)) {
		break;
	}

	int heading, distance;

	calcul_cap_distance_int(last_latitude, last_longitude, targets[i*2], targets[i*2+1], &heading, &distance);

	if(distance > 10000){
		distance = 9999;
	}


	x = 3*6;
	if (displayed_heading[i] != heading) {
		snprintf(message, sizeof(message), "%3d", heading);
		write_line(i2c_dev, message, x, y, 1);
		displayed_heading[i] = heading;
	}

	x = 14*6;
	if (displayed_distance[i] != distance) {
		snprintf(message, sizeof(message), "%4d", distance);
		write_line(i2c_dev, message, x, y, 1);
		displayed_distance[i] = distance;
	}

	y+= 8;
	x = 0;
}

}

		}

		}

	if(tap_state == 1 || bypass == 1){

			bypass = 0;
			multitap += 1;


			if(menu == -1 || menu == -2){

				multitap = 0;
				LOG_INF("GOING IN THE MENU");
				menu = 0;

				clear_display(i2c_dev);
				y=0;

				for(int i=0;i<nb_menu;i++){

					LOG_INF("%s",menu_str[i]);
					x = 6;
					snprintf(message, sizeof(message), "%s",menu_str[i]);
					write_line(i2c_dev, message, x, y, 0);

					if(i == 1){

						if(gps_state == 0){
							snprintf(message, sizeof(message), " OFF");
						}else{
							snprintf(message, sizeof(message), " ON ");
						}

						write_line(i2c_dev,message, 5*6,y,0);

					}
					if(i == 2){

						if(lte_state == 0){
							snprintf(message, sizeof(message), " OFF");
						}else{
							snprintf(message, sizeof(message), " ON ");
						}

						write_line(i2c_dev,message, 5*6,y,0);
					}

				y += 8;


				}


				//Remettre le nouveau caractère
				x = 0;
				y = 0;
				snprintf(message, sizeof(message), ">");
				write_line(i2c_dev, message, x, y, 0);
				confirmation = 0;

			}
			
			if(menu != -1 && multitap == 1){

				multitap = 0;
				confirmation = 0;
				
				//effacer le caractère
				snprintf(message, sizeof(message), " ");
				write_line(i2c_dev, message, 0, menu*8, 1);

				//Changer la position
				menu = (menu + 1 + nb_menu) % nb_menu;

				//Remettre le nouveau caractère
				snprintf(message, sizeof(message), ">");
				write_line(i2c_dev, message, 0, menu*8, 0);

			}

		}

	if(menu != -1 && confirmation >= confirmation_timeout){

				multitap = 0;
				confirmation = 0;

				LOG_ERR("MENU CHOISI: %s",menu_str[menu]);


				switch(menu){

					case 0: 
							exit_menu(i2c_dev);
							first = 0;
							last_tracked = 0;
							last_fix = 0;
							last_in_fix = 0;
							last_unhealthy = 0;
							last_latitude = 0;
							last_longitude = 0;
							break;
					case 1: 
							change_gps(i2c_dev);
							first = 0;
							break;
					case 2:
							change_lte(i2c_dev);
							first = 0;
							break;
					case 3:
							reload_coordinates(i2c_dev);
							first = 0;
							break;
					case 4:
							LOG_WRN("Firmware update disabled during diagnostics");
							break;
					case 5:
							off(i2c_dev);
							break;
				}

			}

		k_sleep(K_MSEC(100));	
		confirmation += 1;	

	}

	return 0;
}
